Fescron/Project-LabEmbeddedDesign2/software/EFM32HG-Embedded2-project/src/ADXL362.c
/***************************************************************************//**
 * @file ADXL362.c
 * @brief All code for the ADXL362 accelerometer.
 * @version 3.1
 * @author Brecht Van Eeckhoudt
 *
 * ******************************************************************************
 *
 * @section Versions
 *
 *   @li v1.0: Started with the code from https://github.com/Fescron/Project-LabEmbeddedDesign1/tree/master/code/SLSTK3400A_ADXL362
 *             Changed file name from accel.c to ADXL362.c.
 *   @li v1.1: Changed PinModeSet `out` value to 0 in initADXL_VCC.
 *   @li v1.2: Changed last argument in GPIO_PinModeSet in method initADXL_VCC to
 *             change the pin mode and enable the pin in one statement.
 *   @li v1.3: Changed some methods and global variables to be static (~hidden).
 *   @li v1.4: Changed delay method and cleaned up includes.
 *   @li v1.5: Added get/set method for the static variable `ADXL_triggered`.
 *   @li v1.6: Changed a lot of things...
 *   @li v1.7: Updated documentation and chanced `USART0` to `ADXL_SPI`.
 *   @li v1.8: Updated code with new DEFINE checks.
 *   @li v1.9: Started using custom enum for range & ODR configuration methods.
 *   @li v2.0: Added testing method to go through all the settings, moved the register definitions.
 *   @li v2.1: Disabled SPI pins on *hard* reset, cleaned up some code.
 *   @li v2.2: Added functionality to check the number of interrupts.
 *   @li v2.3: Updated documentation.
 *   @li v2.4: Changed error numbering.
 *   @li v2.5: Updated ODR enum and changed masking logic for register settings.
 *   @li v3.0: Added functionality to exit methods after `error` call and updated version number.
 *   @li v3.1: Removed `static` before the local variables (not necessary).
 *
 * ******************************************************************************
 *
 * @todo
 *   **Future improvements:**@n
 *     - Check configurations by reading the registers again and return true/false when the registers have/don't have the correct values.
 *     - Enable wake-up mode (`writeADXL(ADXL_REG_POWER_CTL, 0b00001000); // 5th bit`)
 *     - Enable loop mode (with act/inact time registers?) so interrupts don't need to be acknowledged by host (`writeADXL(ADXL_REG_ACT_INACT_CTL, 0b00110000);`)
 *
 * ******************************************************************************
 *
 * @section License
 *
 *   **Copyright (C) 2019 - Brecht Van Eeckhoudt**
 *
 *   This program is free software: you can redistribute it and/or modify
 *   it under the terms of the **GNU General Public License** as published by
 *   the Free Software Foundation, either **version 3** of the License, or
 *   (at your option) any later version.
 *
 *   This program is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU General Public License for more details.
 *
 *   *A copy of the GNU General Public License can be found in the `LICENSE`
 *   file along with this source code.*
 *
 *   @n
 *
 *   Some methods use code obtained from examples from [Silicon Labs' GitHub](https://github.com/SiliconLabs/peripheral_examples).
 *   These sections are licensed under the Silabs License Agreement. See the file
 *   "Silabs_License_Agreement.txt" for details. Before using this software for
 *   any purpose, you must agree to the terms of that agreement.
 *
 ******************************************************************************/


#include <stdint.h>        /* (u)intXX_t */
#include <stdbool.h>       /* "bool", "true", "false" */
#include "em_cmu.h"        /* Clock Management Unit */
#include "em_gpio.h"       /* General Purpose IO (GPIO) peripheral API */
#include "em_usart.h"      /* Universal synchr./asynchr. receiver/transmitter (USART/UART) Peripheral API */

#include "ADXL362.h"       /* Corresponding header file */
#include "pin_mapping.h"   /* PORT and PIN definitions */
#include "debug_dbprint.h" /* Enable or disable printing to UART */
#include "delay.h"         /* Delay functionality */
#include "util.h"          /* Utility functionality */


/* Local definitions - ADXL362 register definitions */
#define ADXL_REG_DEVID_AD 		0x00 /* Reset: 0xAD */
#define ADXL_REG_DEVID_MST 		0x01 /* Reset: 0x1D */
#define ADXL_REG_PARTID 		0x02 /* Reset: 0xF2 */
#define ADXL_REG_REVID 			0x03 /* Reset: 0x01 (can be incremented) */
#define ADXL_REG_XDATA 			0x08
#define ADXL_REG_YDATA 			0x09
#define ADXL_REG_ZDATA 			0x0A
#define ADXL_REG_STATUS 		0x0B
#define ADXL_REG_TEMP_L 		0x14
#define ADXL_REG_TEMP_H 		0x15
#define ADXL_REG_SOFT_RESET 	0x1F /* Needs to be 0x52 ("R") written to for a soft reset */
#define ADXL_REG_THRESH_ACT_L	0x20 /* 7:0 bits used */
#define ADXL_REG_THRESH_ACT_H	0x21 /* 2:0 bits used */
#define ADXL_REG_ACT_INACT_CTL  0x27 /* Activity/Inactivity control register: XX - XX - LINKLOOP - LINKLOOP - INACT_REF - INACT_EN - ACT_REF - ACT_EN */
#define ADXL_REG_INTMAP1 		0x2A /* INT_LOW -- AWAKE -- INACT -- ACT -- FIFO_OVERRUN -- FIFO_WATERMARK -- FIFO_READY -- DATA_READY */
#define ADXL_REG_INTMAP2 		0x2B /* INT_LOW -- AWAKE -- INACT -- ACT -- FIFO_OVERRUN -- FIFO_WATERMARK -- FIFO_READY -- DATA_READY */
#define ADXL_REG_FILTER_CTL 	0x2C /* Write FFxx xxxx (FF = 00 for +-2g, 01 for =-4g, 1x for +- 8g) for measurement range selection */
#define ADXL_REG_POWER_CTL 		0x2D /* Write xxxx xxMM (MM = 10) to: measurement mode */


/* Local variables */
volatile bool ADXL_triggered = false; /* Volatile because it's modified by an interrupt service routine */
volatile uint16_t ADXL_triggercounter = 0; /* Volatile because it's modified by an interrupt service routine */
int8_t XYZDATA[3] = { 0x00, 0x00, 0x00 };
ADXL_Range_t range;
bool ADXL_VDD_initialized = false;


/* Local prototypes */
static void powerADXL (bool enabled);
static void initADXL_SPI (void);
static void softResetADXL (void);
static void resetHandlerADXL (void);
static uint8_t readADXL (uint8_t address);
static void writeADXL (uint8_t address, uint8_t data);
static void readADXL_XYZDATA (void);
static bool checkID_ADXL (void);
static int32_t convertGRangeToGValue (int8_t sensorValue);


/**************************************************************************//**
 * @brief
 *   Initialize the accelerometer.
 *
 * @details
 *   This method calls all the other internal necessary functions.
 *   Clock enable functionality is gathered here instead of in
 *   *lower* (static) functions.
 *****************************************************************************/
void initADXL (void)
{
	/* Enable necessary clocks (just in case) */
	CMU_ClockEnable(cmuClock_HFPER, true); /* GPIO and USART0/1 are High Frequency Peripherals */
	CMU_ClockEnable(cmuClock_GPIO, true);

	/* Initialize and power VDD pin */
	powerADXL(true);

