Fescron/Project-LabEmbeddedDesign2/software/EFM32HG-Embedded2-project/src/ADXL362.c
	/* Power-up delay of 40 ms */
	delay(40);

	/* Enable necessary clock (just in case) */
	if (ADXL_SPI == USART0) CMU_ClockEnable(cmuClock_USART0, true);
	else if (ADXL_SPI == USART1) CMU_ClockEnable(cmuClock_USART1, true);
	else
	{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbcrit("Wrong peripheral selected!");
#endif /* DEBUG_DBPRINT */

		/* Disable power to the VDD pin */
		powerADXL(false);

		error(21);

		/* Exit function */
		return;
	}

	/* Initialize USART0/1 as SPI slave (also initialize CS pin) */
	initADXL_SPI();

	/* Soft reset ADXL handler */
	resetHandlerADXL();
}


/**************************************************************************//**
 * @brief
 *   Getter for the `ADXL_triggercounter` variable.
 *
 * @return
 *   The value of `ADXL_triggercounter`.
 *****************************************************************************/
uint16_t ADXL_getCounter (void)
{
	return (ADXL_triggercounter);
}


/**************************************************************************//**
 * @brief
 *   Method to set the `ADXL_triggercounter` variable back to zero.
 *****************************************************************************/
void ADXL_clearCounter (void)
{
	ADXL_triggercounter = 0;
}


/**************************************************************************//**
 * @brief
 *   Setter for the `ADXL_triggered` variable.
 *
 * @param[in] triggered
 *    @li `true` - Set `ADXL_triggered` to `true`.
 *    @li `false` - Set `ADXL_triggered` to `false`.
 *****************************************************************************/
void ADXL_setTriggered (bool triggered)
{
	ADXL_triggered = triggered;
	ADXL_triggercounter++;
}


/**************************************************************************//**
 * @brief
 *   Getter for the `ADXL_triggered` variable.
 *
 * @return
 *   The value of `ADXL_triggered`.
 *****************************************************************************/
bool ADXL_getTriggered (void)
{
	return (ADXL_triggered);
}


/**************************************************************************//**
 * @brief
 *   Acknowledge the interrupt from the accelerometer.
 *
 * @details
 *   Read a certain register (necessary if the accelerometer is not in
 *   linked-loop mode) and clear the variable.
 *****************************************************************************/
void ADXL_ackInterrupt (void)
{
	readADXL(ADXL_REG_STATUS);
	ADXL_triggered = false;
}


/**************************************************************************//**
 * @brief
 *   Enable or disable the SPI pins and USART0/1 clock and peripheral to the accelerometer.
 *
 * @param[in] enabled
 *   @li `true` - Enable the SPI pins and USART0/1 clock and peripheral to the accelerometer.
 *   @li `false` - Disable the SPI pins and USART0/1 clock and peripheral to the accelerometer.
 *****************************************************************************/
void ADXL_enableSPI (bool enabled)
{
	if (enabled)
	{
		/* Enable USART clock and peripheral */
		if (ADXL_SPI == USART0) CMU_ClockEnable(cmuClock_USART0, true);
		else if (ADXL_SPI == USART1) CMU_ClockEnable(cmuClock_USART1, true);
		else
		{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
			dbcrit("Wrong peripheral selected!");
#endif /* DEBUG_DBPRINT */

			error(22);

			/* Exit function */
			return;
		}

		USART_Enable(ADXL_SPI, usartEnable);

		/* In the case of gpioModePushPull", the last argument directly sets the pin state */
		GPIO_PinModeSet(ADXL_CLK_PORT, ADXL_CLK_PIN, gpioModePushPull, 0);   /* US0_CLK is push pull */
		GPIO_PinModeSet(ADXL_NCS_PORT, ADXL_NCS_PIN, gpioModePushPull, 1);   /* US0_CS is push pull */
		GPIO_PinModeSet(ADXL_MOSI_PORT, ADXL_MOSI_PIN, gpioModePushPull, 1); /* US0_TX (MOSI) is push pull */
		GPIO_PinModeSet(ADXL_MISO_PORT, ADXL_MISO_PIN, gpioModeInput, 1);    /* US0_RX (MISO) is input */
	}
	else
	{
		/* Disable USART clock and peripheral */
		if (ADXL_SPI == USART0) CMU_ClockEnable(cmuClock_USART0, false);
		else if (ADXL_SPI == USART1) CMU_ClockEnable(cmuClock_USART1, false);
		else
		{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
			dbcrit("Wrong peripheral selected!");
#endif /* DEBUG_DBPRINT */

			error(23);

			/* Exit function */
			return;
		}

		USART_Enable(ADXL_SPI, usartDisable);

		/* gpioModeDisabled: Pull-up if DOUT is set. */
		GPIO_PinModeSet(ADXL_CLK_PORT, ADXL_CLK_PIN, gpioModeDisabled, 0);
		GPIO_PinModeSet(ADXL_NCS_PORT, ADXL_NCS_PIN, gpioModeDisabled, 1);
		GPIO_PinModeSet(ADXL_MOSI_PORT, ADXL_MOSI_PIN, gpioModeDisabled, 1);
		GPIO_PinModeSet(ADXL_MISO_PORT, ADXL_MISO_PIN, gpioModeDisabled, 1);
	}
}


/**************************************************************************//**
 * @brief
 *   Enable or disable measurement mode.
 *
 * @param[in] enabled
 *   @li `true` - Enable measurement mode.
 *   @li `false` - Disable measurement mode (standby).
 *****************************************************************************/
void ADXL_enableMeasure (bool enabled)
{
	if (enabled)
	{
		/* Get value in register */
		uint8_t reg = readADXL(ADXL_REG_POWER_CTL);

		/* AND with mask to keep the bits we don't want to change */
		reg &= 0b11111100;

		/* Enable measurements (OR with new setting bits) */
		writeADXL(ADXL_REG_POWER_CTL, reg | 0b00000010); /* Last 2 bits are measurement mode */

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbinfo("ADXL362: Measurement enabled");
#endif /* DEBUG_DBPRINT */

	}
	else
	{
		/* Get value in register */
		uint8_t reg = readADXL(ADXL_REG_POWER_CTL);

		/* AND with mask to keep the bits we don't want to change */
		reg &= 0b11111100;

		/* Disable measurements (OR with new setting bits) */
		writeADXL(ADXL_REG_POWER_CTL, reg | 0b00000000); /* Last 2 bits are measurement mode */

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbinfo("ADXL362: Measurement disabled (standby)");
#endif /* DEBUG_DBPRINT */

	}
}


/**************************************************************************//**
 * @brief
 *   Configure the measurement range and store the selected one in
 *   a global variable for later (internal) use.
 *
 * @details
 *   When a range of, for example "2g" is selected, the real range is "+-2g".
 *
 * @param[in] givenRange
 *   The selected range.
 *****************************************************************************/
void ADXL_configRange (ADXL_Range_t givenRange)
{
	/* Get value in register */
	uint8_t reg = readADXL(ADXL_REG_FILTER_CTL);

	/* AND with mask to keep the bits we don't want to change */
	reg &= 0b00111111;

	/* Set measurement range (OR with new setting bits, first two bits) */
	if (givenRange == ADXL_RANGE_2G)
	{
		writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000000));
		range = ADXL_RANGE_2G;
	}
	else if (givenRange == ADXL_RANGE_4G)
	{
		writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b01000000));
		range = ADXL_RANGE_4G;
	}
	else if (givenRange == ADXL_RANGE_8G)
	{
		writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b10000000));
		range = ADXL_RANGE_8G;
	}
	else
	{

