Fescron/Project-LabEmbeddedDesign2/software/EFM32HG-Embedded2-project/src/ADXL362.c
#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbcrit("Non-existing range selected!");
#endif /* DEBUG_DBPRINT */

		error(24);

		/* Exit function */
		return;
	}

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
	if (range == ADXL_RANGE_2G) dbinfo("ADXL362: Measurement mode +- 2g selected");
	else if (range == ADXL_RANGE_4G) dbinfo("ADXL362: Measurement mode +- 4g selected");
	else if (range == ADXL_RANGE_8G) dbinfo("ADXL362: Measurement mode +- 8g selected");
#endif /* DEBUG_DBPRINT */

}


/**************************************************************************//**
 * @brief
 *   Configure the Output Data Rate (ODR).
 *
 * @param[in] givenODR
 *   The selected ODR.
 *****************************************************************************/
void ADXL_configODR (ADXL_ODR_t givenODR)
{
	/* Get value in register */
	uint8_t reg = readADXL(ADXL_REG_FILTER_CTL);

	/* AND with mask to keep the bits we don't want to change */
	reg &= 0b11111000;

	/* Set ODR (OR with new setting bits, last three bits) */
	if (givenODR == ADXL_ODR_12_5_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000000));
	else if (givenODR == ADXL_ODR_25_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000001));
	else if (givenODR == ADXL_ODR_50_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000010));
	else if (givenODR == ADXL_ODR_100_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000011));
	else if (givenODR == ADXL_ODR_200_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000100));
	else if (givenODR == ADXL_ODR_400_HZ) writeADXL(ADXL_REG_FILTER_CTL, (reg | 0b00000101));
	else
	{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbcrit("Non-existing ODR selected!");
#endif /* DEBUG_DBPRINT */

		error(25);

		/* Exit function */
		return;
	}

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
	if (givenODR == ADXL_ODR_12_5_HZ) dbinfo("ADXL362: ODR set at 12.5 Hz");
	else if (givenODR == ADXL_ODR_25_HZ) dbinfo("ADXL362: ODR set at 25 Hz");
	else if (givenODR == ADXL_ODR_50_HZ) dbinfo("ADXL362: ODR set at 50 Hz");
	else if (givenODR == ADXL_ODR_100_HZ) dbinfo("ADXL362: ODR set at 100 Hz");
	else if (givenODR == ADXL_ODR_200_HZ) dbinfo("ADXL362: ODR set at 200 Hz");
	else if (givenODR == ADXL_ODR_400_HZ) dbinfo("ADXL362: ODR set at 400 Hz");
#endif /* DEBUG_DBPRINT */

}


/**************************************************************************//**
 * @brief
 *   Configure the accelerometer to work in (referenced) activity threshold mode.
 *
 * @details
 *   Route activity detector to INT1 pin using INTMAP1, isolate bits
 *   and write settings to both threshold registers.
 *
 *   **Referenced** means that during the initialization a *reference acceleration* gets
 *   measured (like for example `1 g` on a certain axis) and stored internally. This value
 *   always gets internally subtracted from a measured acceleration value to calculate
 *   the final value and check if it exceeds the set threshold:
 *     - `ABS(acceleration - reference) > threshold`
 *
 * @param[in] gThreshold
 *   Threshold [g].
 *****************************************************************************/
void ADXL_configActivity (uint8_t gThreshold)
{
	/* Map activity detector to INT1 pin  */
	writeADXL(ADXL_REG_INTMAP1, 0b00010000); /* Bit 4 selects activity detector */

	/* Enable referenced activity threshold mode (last two bits) */
	writeADXL(ADXL_REG_ACT_INACT_CTL, 0b00000011);

	/* Convert g value to "codes"
	 *   THRESH_ACT [codes] = Threshold Value [g] × Scale Factor [LSB per g] */
	uint8_t threshold;

	if (range == ADXL_RANGE_2G) threshold = gThreshold * 1000;
	else if (range == ADXL_RANGE_4G) threshold = gThreshold * 500;
	else if (range == ADXL_RANGE_8G) threshold = gThreshold * 250;
	else
	{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbcrit("Range wrong, can't set gThreshold!");
#endif /* DEBUG_DBPRINT */

		error(26);

		/* Exit function */
		return;
	}

	/* Isolate bits using masks and shifting */
	uint8_t low  = (threshold & 0b0011111111);
	uint8_t high = (threshold & 0b1100000000) >> 8;

	/* Set threshold register values (total: 11bit unsigned) */
	writeADXL(ADXL_REG_THRESH_ACT_L, low);  /* 7:0 bits used */
	writeADXL(ADXL_REG_THRESH_ACT_H, high); /* 2:0 bits used */

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
	dbinfoInt("ADXL362: Activity configured: ", gThreshold, "g");
#endif /* DEBUG_DBPRINT */

}


/**************************************************************************//**
 * @brief
 *   Read and display "g" values forever with a 100ms interval.
 *****************************************************************************/
void ADXL_readValues (void)
{
	uint32_t counter = 0;

	/* Enable measurement mode */
	ADXL_enableMeasure(true);

	/* Infinite loop */
	while (1)
	{
		led(true); /* Enable LED */

		readADXL_XYZDATA(); /* Read XYZ sensor data */

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		/* Print XYZ sensor data */
		dbprint("\r[");
		dbprintInt(counter);
		dbprint("] X: ");
		dbprintInt(convertGRangeToGValue(XYZDATA[0]));
		dbprint(" mg | Y: ");
		dbprintInt(convertGRangeToGValue(XYZDATA[1]));
		dbprint(" mg | Z: ");
		dbprintInt(convertGRangeToGValue(XYZDATA[2]));
		dbprint(" mg       "); /* Extra spacing is to overwrite other data if it's remaining (see \r) */
#endif /* DEBUG_DBPRINT */

		led(false); /* Disable LED */

		counter++;

		delay(100);
	}
}


/**************************************************************************//**
 * @brief
 *   This method goes through all of the ODR settings to see the influence
 *   they have on power usage. The measurement range is the default one (+-2g).
 *
 * @details
 *   To get the "correct" currents the delay method puts the MCU to EM2/3 sleep
 *   and the SPI lines are disabled. The order of the test is:
 *     - Wait 5 seconds
 *     - Soft reset the accelerometer
 *     - One second in "standby" mode
 *     - Enable "measurement" mode
 *     - One second in ODR 12.5 Hz
 *     - One second in ODR 25 Hz
 *     - One second in ODR 50 Hz
 *     - One second in ODR 100 Hz
 *     - One second in ODR 200 Hz
 *     - One second in ODR 400 Hz
 *     - Soft reset the accelerometer
 *****************************************************************************/
void testADXL (void)
{
	delay(5000);

	/* Soft reset ADXL */
	softResetADXL();

	/* Standby */
	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

