Fescron/Project-LabEmbeddedDesign2/software/EFM32HG-Embedded2-project/src/ADXL362.c
	/* ODR 12,5Hz */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010000); /* last 3 bits are ODR */

	/* Enable measurements */
	writeADXL(ADXL_REG_POWER_CTL, 0b00000010); /* last 2 bits are measurement mode */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* ODR 25Hz */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010001); /* last 3 bits are ODR */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* ODR 50Hz */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010010); /* last 3 bits are ODR */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* ODR 100Hz (default) */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010011); /* last 3 bits are ODR */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* ODR 200Hz */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010100); /* last 3 bits are ODR */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* ODR 400Hz */
	writeADXL(ADXL_REG_FILTER_CTL, 0b00010101); /* last 3 bits are ODR */

	ADXL_enableSPI(false); /* Disable SPI functionality */
	delay(1000);
	ADXL_enableSPI(true);  /* Enable SPI functionality */

	/* Soft reset ADXL */
	softResetADXL();
}


/**************************************************************************//**
 * @brief
 *   Initialize USARTx in SPI mode according to the settings required
 *   by the accelerometer.
 *
 * @details
 *   Configure pins, configure USARTx in SPI mode, route
 *   the pins, enable USARTx and set CS high.
 *   Necessary clocks are enabled in a previous method.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *****************************************************************************/
static void initADXL_SPI (void)
{
	/* Configure GPIO */
	/* In the case of gpioModePushPull", the last argument directly sets the pin state */
	GPIO_PinModeSet(ADXL_CLK_PORT, ADXL_CLK_PIN, gpioModePushPull, 0);   /* US0_CLK is push pull */
	GPIO_PinModeSet(ADXL_NCS_PORT, ADXL_NCS_PIN, gpioModePushPull, 1);   /* US0_CS is push pull */
	GPIO_PinModeSet(ADXL_MOSI_PORT, ADXL_MOSI_PIN, gpioModePushPull, 1); /* US0_TX (MOSI) is push pull */
	GPIO_PinModeSet(ADXL_MISO_PORT, ADXL_MISO_PIN, gpioModeInput, 1);    /* US0_RX (MISO) is input */

	/* Start with default config */
	USART_InitSync_TypeDef config = USART_INITSYNC_DEFAULT;

	/* Modify some settings */
	config.enable       = false;           	/* making sure to keep USART disabled until we've set everything up */
	config.refFreq      = 0;			 	/* USART/UART reference clock assumed when configuring baud rate setup. Set to 0 to use the currently configured reference clock. */
	config.baudrate     = 4000000;         	/* CLK freq is 1 MHz (1000000) */
	config.databits     = usartDatabits8;	/* master mode */
	config.master       = true;            	/* master mode */
	config.msbf         = true;            	/* send MSB first */
	config.clockMode    = usartClockMode0; 	/* clock idle low, sample on rising/first edge (Clock polarity/phase mode = CPOL/CPHA) */
	config.prsRxEnable = false;				/* If enabled: Enable USART Rx via PRS. */
	config.autoTx = false; 					/* If enabled: Enable AUTOTX mode. Transmits as long as RX is not full. Generates underflows if TX is empty. */
	config.autoCsEnable = false;            /* CS pin controlled by hardware, not firmware */

	/* Initialize USART0/1 with the configured parameters */
	USART_InitSync(ADXL_SPI, &config);

	/* Set the pin location for USART0/1 (before: USART_ROUTE_LOCATION_LOC0) */
	ADXL_SPI->ROUTE = USART_ROUTE_CLKPEN | USART_ROUTE_CSPEN | USART_ROUTE_TXPEN | USART_ROUTE_RXPEN | ADXL_SPI_LOC;

	/* Enable USART0/1 */
	USART_Enable(ADXL_SPI, usartEnable);

	/* Set CS high (active low!) */
	GPIO_PinOutSet(gpioPortE, 13);
}


/**************************************************************************//**
 * @brief
 *   Soft reset accelerometer handler.
 *
 * @details
 *   If the first ID check fails, the MCU is put on hold for one second
 *   and the ID gets checked again.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *****************************************************************************/
static void resetHandlerADXL (void)
{
	uint8_t retries = 0;

	/* Soft reset ADXL */
	softResetADXL();

	/* First try to get the correct ID failed */
	if (!checkID_ADXL())
	{
		retries++;

		delay(1000);

		/* Soft reset */
		softResetADXL();

		/* Second try to get the correct ID failed */
		if (!checkID_ADXL())
		{
			retries++;

			delay(1000);

			/* Soft reset */
			softResetADXL();

			/* Third try to get the correct ID failed
			 * resorting to "hard" reset! */
			if (!checkID_ADXL())
			{
				retries++;

				powerADXL(false);
				ADXL_enableSPI(false); /* Make sure the accelerometer doesn't get power through the SPI pins */

				delay(1000);

				powerADXL(true);
				ADXL_enableSPI(true);

				delay(1000);

				/* Soft reset */
				softResetADXL();

				/* Last try to get the correct ID failed */
				if (!checkID_ADXL())
				{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
					dbcrit("ADXL362 initialization failed");
#endif /* DEBUG_DBPRINT */

					error(20);

					/* Exit function */
					return;
				}
			}
		}
	}

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
	if (retries < 2) dbinfoInt("ADXL362 initialized (", retries, " soft reset retries)");
	else dbwarnInt("ADXL362 initialized (had to \"hard reset\", ", retries, " soft reset retries)");
#endif /* DEBUG_DBPRINT */

}


/**************************************************************************//**
 * @brief
 *   Read an SPI byte from the accelerometer (8 bits) using a given address.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *
 * @param[in] address
 *   The register address to read from.
 *
 * @return
 *   The response (one byte, `uint8_t`).
 *****************************************************************************/
static uint8_t readADXL (uint8_t address)
{
	uint8_t response;

	/* Set CS low (active low!) */
	GPIO_PinOutClear(ADXL_NCS_PORT, ADXL_NCS_PIN);

