Fescron/Project-LabEmbeddedDesign2/software/EFM32HG-Embedded2-project/src/ADXL362.c
	/* 3-byte operation according to datasheet */
	USART_SpiTransfer(ADXL_SPI, 0x0B);            /* "read" instruction */
	USART_SpiTransfer(ADXL_SPI, address);         /* Address */
	response = USART_SpiTransfer(ADXL_SPI, 0x00); /* Read response */

	/* Set CS high */
	GPIO_PinOutSet(ADXL_NCS_PORT, ADXL_NCS_PIN);

	return (response);
}


/**************************************************************************//**
 * @brief
 *   Write an SPI byte to the accelerometer (8 bits) using a given address
 *   and specified data.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *
 * @param[in] address
 *   The register address to write the data to (one byte, `uint8_t`).
 *
 * @param[in] data
 *   The data to write to the address (one byte, `uint8_t`).
 *****************************************************************************/
static void writeADXL (uint8_t address, uint8_t data)
{
	/* Set CS low (active low!) */
	GPIO_PinOutClear(ADXL_NCS_PORT, ADXL_NCS_PIN);

	/* 3-byte operation according to datasheet */
	USART_SpiTransfer(ADXL_SPI, 0x0A);    /* "write" instruction */
	USART_SpiTransfer(ADXL_SPI, address); /* Address */
	USART_SpiTransfer(ADXL_SPI, data);    /* Data */

	/* Set CS high */
	GPIO_PinOutSet(ADXL_NCS_PORT, ADXL_NCS_PIN);
}


/**************************************************************************//**
 * @brief
 *   Read the X-Y-Z data registers in the `XYZDATA[]` field using burst reads.
 *
 * @details
 *   Response data gets put in `XYZDATA` array (global volatile variable).
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *****************************************************************************/
static void readADXL_XYZDATA (void)
{
	/* CS low (active low!) */
	GPIO_PinOutClear(ADXL_NCS_PORT, ADXL_NCS_PIN);

	/* Burst read (address auto-increments) */
	USART_SpiTransfer(ADXL_SPI, 0x0B);				/* "read" instruction */
	USART_SpiTransfer(ADXL_SPI, ADXL_REG_XDATA);    /* Address */
	XYZDATA[0] = USART_SpiTransfer(ADXL_SPI, 0x00);	/* Read response */
	XYZDATA[1] = USART_SpiTransfer(ADXL_SPI, 0x00);	/* Read response */
	XYZDATA[2] = USART_SpiTransfer(ADXL_SPI, 0x00);	/* Read response */

	/* CS high */
	GPIO_PinOutSet(ADXL_NCS_PORT, ADXL_NCS_PIN);
}


/**************************************************************************//**
 * @brief
 *   Enable or disable the power to the accelerometer.
 *
 * @details
 *   This method also initializes the pin-mode if necessary.
 *   Necessary clocks are enabled in a previous method.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *
 * @param[in] enabled
 *   @li `true` - Enable the GPIO pin connected to the VDD pin of the accelerometer.
 *   @li `false` - Disable the GPIO pin connected to the VDD pin of the accelerometer.
 *****************************************************************************/
static void powerADXL (bool enabled)
{
	/* Initialize VDD pin if not already the case */
	if (!ADXL_VDD_initialized)
	{
		/* In the case of gpioModePushPull", the last argument directly sets the pin state */
		GPIO_PinModeSet(ADXL_VDD_PORT, ADXL_VDD_PIN, gpioModePushPull, enabled);

		ADXL_VDD_initialized = true;
	}
	else
	{
		if (enabled) GPIO_PinOutSet(ADXL_VDD_PORT, ADXL_VDD_PIN); /* Enable VDD pin */
		else GPIO_PinOutClear(ADXL_VDD_PORT, ADXL_VDD_PIN); /* Disable VDD pin */
	}
}


/**************************************************************************//**
 * @brief
 *   Soft reset accelerometer.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *****************************************************************************/
static void softResetADXL (void)
{
	writeADXL(ADXL_REG_SOFT_RESET, 0x52); /* 0x52 = "R" */
}


/**************************************************************************//**
 * @brief Check if the ID is correct.
 *
 * @note
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *
 * @return
 *   @li `true` - Correct ID returned.
 *   @li `false` - Incorrect ID returned.
 *****************************************************************************/
static bool checkID_ADXL (void)
{
	return (readADXL(ADXL_REG_DEVID_AD) == 0xAD);
}


/**************************************************************************//**
 * @brief
 *   Convert sensor value in +-g range to mg value.
 *
 * @note
 *   Info found at http://ozzmaker.com/accelerometer-to-g/ @n
 *   This is a static method because it's only internally used in this file
 *   and called by other methods if necessary.
 *
 * @param[in] sensorValue
 *   Value in g-range returned by sensor.
 *
 * @return
 *   The calculated mg value.
 *****************************************************************************/
static int32_t convertGRangeToGValue (int8_t sensorValue)
{
	/* Explanation of the used numbers:
	 *   - 255 = (-) 128 + 127
	 *   - 2 = "+" & "-"
	 *   - 1000 = "m"g */

	if (range == ADXL_RANGE_2G) return ((2*2*1000 / 255) * sensorValue);
	else if (range == ADXL_RANGE_4G) return ((2*4*1000 / 255) * sensorValue);
	else if (range == ADXL_RANGE_8G) return ((2*8*1000 / 255) * sensorValue);
	else
	{

#if DEBUG_DBPRINT == 1 /* DEBUG_DBPRINT */
		dbcrit("Range wrong, can't calculate mg value!");
#endif /* DEBUG_DBPRINT */

		error(27);

		/* Exit function */
		return (0);
	}
}
